In [40]:
import numpy as np

In [41]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
array = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
ser1 = pd.Series([1,2,3,4],["Kottayam","Kochi","Pala","Kollam"])

In [15]:
ser1

Kottayam    1
Kochi       2
Pala        3
Kollam      4
dtype: int64

In [17]:
ser2 = pd.Series([5,6,7,8],["Bremen","berlin","hamburg","munich"])

In [18]:
ser2

Bremen     5
berlin     6
hamburg    7
munich     8
dtype: int64

In [20]:
ser1["Kottayam"]

np.int64(1)

In [21]:
ser1+ser2

Bremen     NaN
Kochi      NaN
Kollam     NaN
Kottayam   NaN
Pala       NaN
berlin     NaN
hamburg    NaN
munich     NaN
dtype: float64

Data Frames

In [43]:
from numpy.random import randn

In [5]:
np.random.seed(101) # np.random.seed()is used to generate a pseudo random number .If two poeple put np.random.seed(101 or any same number), both users will get a same psuedo random number

In [6]:
df = pd.DataFrame(randn(5,4),["a","b","c","d","e"],["W","X","Y","Z"])

Columns

In [7]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [8]:
df["W"]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

In [10]:
type(df["W"])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[["W","Z"]]

          W         Z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [13]:
df["new"]=df["W"]+df["Z"]

In [14]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
df.drop("new", axis=1) # this is just temporary drop and not permanent drop from the dataframe

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [16]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
# For permanently dropping
df.drop("new",axis=1,inplace=True)

In [20]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [23]:
df.drop("e") # axis = 0 by default

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [25]:
df.shape #shape of the dataframe

(5, 4)

ROWS

In [26]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [27]:
df.loc["c"]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [28]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [30]:
#Locating an element from DF
df.loc["c","Y"]

np.float64(0.5288134940893595)

In [31]:
# For getting multiple elements from from a dataframe
df.loc[["a","b"],["Y","Z"]]

          Y         Z
a  0.907969  0.503826
b -0.848077  0.605965

In [32]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

Conditional Selection using DataFrame

In [33]:
df>0

       W      X      Y      Z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [34]:
df[df>1]

         W         X         Y   Z
a  2.70685       NaN       NaN NaN
b      NaN       NaN       NaN NaN
c      NaN       NaN       NaN NaN
d      NaN       NaN       NaN NaN
e      NaN  1.978757  2.605967 NaN

In [35]:
df[df<-2]

          W   X   Y   Z
a       NaN NaN NaN NaN
b       NaN NaN NaN NaN
c -2.018168 NaN NaN NaN
d       NaN NaN NaN NaN
e       NaN NaN NaN NaN

In [40]:
df[df["W"]>1]

         W         X         Y         Z
a  2.70685  0.628133  0.907969  0.503826

In [41]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [58]:
df["Z"]>0

a     True
b     True
c    False
d     True
e     True
Name: Z, dtype: bool

In [54]:
df[df["W"]>0][["X","Y"]]

          X         Y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

Multiple Conditions

In [59]:
# and operation
df[(df["W"]>0) & (df["Y"]>1)]

          W         X         Y         Z
e  0.190794  1.978757  2.605967  0.683509

In [61]:
# or operation
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [74]:
# to reset index to stock pandas index(0,1,2....) // TEMPORARY
#The old index will become a column of the dataframe
df.reset_index()

  index         W         X         Y         Z
0     a  0.302665  1.693723 -1.706086 -1.159119
1     b -0.134841  0.390528  0.166905  0.184502
2     c  0.807706  0.072960  0.638787  0.329646
3     d -0.497104 -0.754070 -0.943406  0.484752
4     e -0.116773  1.901755  0.238127  1.996652

In [65]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
# PERMANENT Index RESET
df.reset_index(inplace=True)

In [71]:
df

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.reset_index(inplace=F)

   level_0 index         W         X         Y         Z
0        0     a  2.706850  0.628133  0.907969  0.503826
1        1     b  0.651118 -0.319318 -0.848077  0.605965
2        2     c -2.018168  0.740122  0.528813 -0.589001
3        3     d  0.188695 -0.758872 -0.933237  0.955057
4        4     e  0.190794  1.978757  2.605967  0.683509

In [72]:
df = pd.DataFrame(randn(5,4),["a","b","c","d","e"],["W","X","Y","Z"])

In [75]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [21]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
#double_side =[1,3,2,3,2,1]

In [ ]:
#hier_index = list(zip(outside,inside,double_side)) # converts multiple lists into tuples, triples etc.....
#hier_index

[('G1', 1, 1),
 ('G1', 2, 3),
 ('G1', 3, 2),
 ('G2', 1, 3),
 ('G2', 2, 2),
 ('G2', 3, 1)]

In [22]:
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [23]:
hier_index= pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [29]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)

In [28]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ( 'G', 2),
            ('G2', 3)],
           )

In [30]:
import pandas as pd

# Your original code
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [33]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [32]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [44]:
df = pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [45]:
df

             A         B
G1 1  0.370110  0.063952
   2  0.404981  0.446422
   3  0.068055  0.767652
G2 1 -0.715254  0.251390
   2  0.169298 -0.610217
   3  0.859588  0.148949

In [46]:
df.loc["G1"]

          A         B
1  0.370110  0.063952
2  0.404981  0.446422
3  0.068055  0.767652

In [48]:
df.loc["G1"].loc[1].loc["A"]

np.float64(0.3701100261776959)

In [50]:
df.index.names = ["Groups","Num"]

In [52]:
df.index.names

FrozenList(['Groups', 'Num'])

In [55]:
df.loc["G2"].loc[2].loc["B"]

np.float64(-0.610217405179661)

In [56]:
df

                   A         B
Groups Num
G1     1    0.370110  0.063952
       2    0.404981  0.446422
       3    0.068055  0.767652
G2     1   -0.715254  0.251390
       2    0.169298 -0.610217
       3    0.859588  0.148949

In [57]:
df.loc["G1"].loc[2].loc["A"]

np.float64(0.40498073073732627)

In [59]:
df.xs(3,level="Num")

               A         B
Groups
G1      0.068055  0.767652
G2      0.859588  0.148949

In [60]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [63]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()# drops all columns(axis =0)/rows(axis =1) that has at least one NaN value

     A    B  C
0  1.0  5.0  1

In [66]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [68]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [69]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.fillna(value="Fill_Value")

            A           B  C
0         1.0         5.0  1
1         2.0  Fill_Value  2
2  Fill_Value  Fill_Value  3

In [72]:
df["B"].fillna(value=df["B"].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [82]:
data = {"Company":["GOOG","GOOG","MSFT","MSFT","FB","FB"],
        "Person":["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
        "Sales":[200,120,340,124,243,350]}

In [83]:
df = pd.DataFrame(data)

In [77]:
df

          0
0    Persom
1  Comapany